const localisations = {
    startMessage: 'Хочешь к нам?',
    selectResearches: "Выбери научное направление: 👇",
    researchDescription: "Описание направления",
    iDontUnderstand: "Я не понимаю...",
    botAnswers: {
        invitationToRegistration: "Отлично! Для отправки заявки необходимо заполнить еще некоторые данные о себе",
    },
    superAdministratorActions: {
        confirmApplication: "Ваша заявка подтверждена. Приходите для встречи с руководителем направления в ауд. 3215 в 11:00 по вторникам и четвергам",
        denyApplication: "Ваша заявка удалена, т.к. содержит некорректные данные"
    },
    postRequests: {
        startEquipment: {success: "Начата работа на оборудовании"}
    }
};

module.exports = localisations;